## Plan Result (635: sandbox_enterprise - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 20 to add, 2 to change, 10 to destroy.</code></pre>

* Create
  * module.enterprise.module.bootstrap.azurerm_role_assignment.pim_approvers_contributor[&#34;CFT&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.pim_approvers_contributor[&#34;CFT-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.pim_approvers_contributor[&#34;Crime&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.pim_approvers_contributor[&#34;HMCTS&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.pim_approvers_contributor[&#34;Heritage&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.pim_approvers_contributor[&#34;Heritage-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.pim_approvers_contributor[&#34;Platform&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.pim_approvers_contributor[&#34;Platform-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.pim_approvers_contributor[&#34;SDS&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.pim_approvers_contributor[&#34;SDS-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.production_contributor[&#34;CFT&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.production_contributor[&#34;CFT-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.production_contributor[&#34;Crime&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.production_contributor[&#34;HMCTS&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.production_contributor[&#34;Heritage&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.production_contributor[&#34;Heritage-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.production_contributor[&#34;Platform&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.production_contributor[&#34;Platform-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.production_contributor[&#34;SDS&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.production_contributor[&#34;SDS-Prod&#34;]
* Update
  * module.subscription[&#34;DTS-RBAC-NONPRODUCTION&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DTS-Terraform-Dev-Test4&#34;].azurerm_storage_container.sc
* Delete
  * module.enterprise.module.bootstrap.azurerm_role_assignment.contributors[&#34;CFT&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.contributors[&#34;CFT-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.contributors[&#34;Crime&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.contributors[&#34;HMCTS&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.contributors[&#34;Heritage&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.contributors[&#34;Heritage-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.contributors[&#34;Platform&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.contributors[&#34;Platform-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.contributors[&#34;SDS&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.contributors[&#34;SDS-Prod&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.subscription["DTS-RBAC-NONPRODUCTION"].azurerm_storage_container.sc will be updated in-place
  ~ resource "azurerm_storage_container" "sc" {
        id                                = "https://c06069648f3a1ed8e38bcsa.blob.core.windows.net/subscription-tfstate"
        name                              = "subscription-tfstate"
      + storage_account_id                = "/subscriptions/55922b0d-5c33-467f-91b9-42c4059d310c/resourceGroups/azure-control-dev-rg/providers/Microsoft.Storage/storageAccounts/c06069648f3a1ed8e38bcsa"
      - storage_account_name              = "c06069648f3a1ed8e38bcsa" -> null
        # (7 unchanged attributes hidden)
    }

  # module.subscription["DTS-Terraform-Dev-Test4"].azurerm_storage_container.sc will be updated in-place
  ~ resource "azurerm_storage_container" "sc" {
        id                                = "https://c173a0e9679e4abc83ab0sa.blob.core.windows.net/subscription-tfstate"
        name                              = "subscription-tfstate"
      + storage_account_id                = "/subscriptions/55922b0d-5c33-467f-91b9-42c4059d310c/resourceGroups/azure-control-dev-rg/providers/Microsoft.Storage/storageAccounts/c173a0e9679e4abc83ab0sa"
      - storage_account_name              = "c173a0e9679e4abc83ab0sa" -> null
        # (7 unchanged attributes hidden)
    }

  # module.enterprise.module.bootstrap.data.azuread_group.pim_approvers will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azuread_group" "pim_approvers" {
      + assignable_to_role             = (known after apply)
      + auto_subscribe_new_members     = (known after apply)
      + behaviors                      = (known after apply)
      + description                    = (known after apply)
      + display_name                   = "DTS Azure PIM Approvers (CNP)"
      + dynamic_membership             = (known after apply)
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_enabled                   = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + provisioning_options           = (known after apply)
      + proxy_addresses                = (known after apply)
      + security_enabled               = (known after apply)
      + theme                          = (known after apply)
      + types                          = (known after apply)
      + visibility                     = (known after apply)
      + writeback_enabled              = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.contributors["CFT"] will be destroyed
  # (because key ["CFT"] is not in for_each map)
  - resource "azurerm_role_assignment" "contributors" {
      - id                                     = "/providers/Microsoft.Management/managementGroups/CFT/providers/Microsoft.Authorization/roleAssignments/3cd3a042-354e-24d9-52fe-6a768fd6cab6" -> null
      - name                                   = "3cd3a042-354e-24d9-52fe-6a768fd6cab6" -> null
      - principal_id                           = "b90c1bc9-de15-4ba8-8bff-3b42fa59df1e" -> null
      - principal_type                         = "Group" -> null
      - role_definition_id                     = "/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c" -> null
      - role_definition_name                   = "Contributor" -> null
      - scope                                  = "/providers/Microsoft.Management/managementGroups/CFT" -> null
        # (4 unchanged attributes hidden)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.contributors["CFT-Prod"] will be destroyed
  # (because key ["CFT-Prod"] is not in for_each map)
  - resource "azurerm_role_assignment" "contributors" {
      - id                                     = "/providers/Microsoft.Management/managementGroups/CFT-Prod/providers/Microsoft.Authorization/roleAssignments/badf8841-e004-d792-5c23-879f4f87dc4c" -> null
      - name                                   = "badf8841-e004-d792-5c23-879f4f87dc4c" -> null
      - principal_id                           = "7ade8023-21c6-4ee1-a8c6-6a9520236809" -> null
      - principal_type                         = "Group" -> null
      - role_definition_id                     = "/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c" -> null
      - role_definition_name                   = "Contributor" -> null
      - scope                                  = "/providers/Microsoft.Management/managementGroups/CFT-Prod" -> null
        # (4 unchanged attributes hidden)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.contributors["Crime"] will be destroyed
  # (because key ["Crime"] is not in for_each map)
  - resource "azurerm_role_assignment" "contributors" {
      - id                                     = "/providers/Microsoft.Management/managementGroups/Crime/providers/Microsoft.Authorization/roleAssignments/806b6982-5044-b423-685b-c423a8d9d06d" -> null
      - name                                   = "806b6982-5044-b423-685b-c423a8d9d06d" -> null
      - principal_id                           = "009b8482-342f-4de9-8c7c-9681edf566c5" -> null
      - principal_type                         = "Group" -> null
      - role_definition_id                     = "/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c" -> null
      - role_definition_name                   = "Contributor" -> null
      - scope                                  = "/providers/Microsoft.Management/managementGroups/Crime" -> null
        # (4 unchanged attributes hidden)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.contributors["HMCTS"] will be destroyed
  # (because key ["HMCTS"] is not in for_each map)
  - resource "azurerm_role_assignment" "contributors" {
      - id                                     = "/providers/Microsoft.Management/managementGroups/HMCTS/providers/Microsoft.Authorization/roleAssignments/017c65cd-e827-d3a9-e676-bf04df83111b" -> null
      - name                                   = "017c65cd-e827-d3a9-e676-bf04df83111b" -> null
      - principal_id                           = "f0e1124b-4e98-4a93-8981-40a659198d21" -> null
      - principal_type                         = "Group" -> null
      - role_definition_id                     = "/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c" -> null
      - role_definition_name                   = "Contributor" -> null
      - scope                                  = "/providers/Microsoft.Management/managementGroups/HMCTS" -> null
        # (4 unchanged attributes hidden)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.contributors["Heritage"] will be destroyed
  # (because key ["Heritage"] is not in for_each map)
  - resource "azurerm_role_assignment" "contributors" {
      - id                                     = "/providers/Microsoft.Management/managementGroups/Heritage/providers/Microsoft.Authorization/roleAssignments/c1bd5888-ab83-eeae-3c7c-cb7b95e24934" -> null
      - name                                   = "c1bd5888-ab83-eeae-3c7c-cb7b95e24934" -> null
      - principal_id                           = "3df758b7-2f50-4617-88cf-681c323d2aff" -> null
      - principal_type                         = "Group" -> null
      - role_definition_id                     = "/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c" -> null
      - role_definition_name                   = "Contributor" -> null
      - scope                                  = "/providers/Microsoft.Management/managementGroups/Heritage" -> null
        # (4 unchanged attributes hidden)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.contributors["Heritage-Prod"] will be destroyed
  # (because key ["Heritage-Prod"] is not in for_each map)
  - resource "azurerm_role_assignment" "contributors" {
      - id                                     = "/providers/Microsoft.Management/managementGroups/Heritage-Prod/providers/Microsoft.Authorization/roleAssignments/f28ff3df-f30e-7f49-6c6f-8a8e979d5958" -> null
      - name                                   = "f28ff3df-f30e-7f49-6c6f-8a8e979d5958" -> null
      - principal_id                           = "7e6f2709-889c-4770-b283-87d04995819d" -> null
      - principal_type                         = "Group" -> null
      - role_definition_id                     = "/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c" -> null
      - role_definition_name                   = "Contributor" -> null
      - scope                                  = "/providers/Microsoft.Management/managementGroups/Heritage-Prod" -> null
        # (4 unchanged attributes hidden)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.contributors["Platform"] will be destroyed
  # (because key ["Platform"] is not in for_each map)
  - resource "azurerm_role_assignment" "contributors" {
      - id                                     = "/providers/Microsoft.Management/managementGroups/Platform/providers/Microsoft.Authorization/roleAssignments/4b988069-9947-deb8-8d37-dae841c6482a" -> null
      - name                                   = "4b988069-9947-deb8-8d37-dae841c6482a" -> null
      - principal_id                           = "a8bbadf2-69a0-4297-be4f-252e400979f8" -> null
      - principal_type                         = "Group" -> null
      - role_definition_id                     = "/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c" -> null
      - role_definition_name                   = "Contributor" -> null
      - scope                                  = "/providers/Microsoft.Management/managementGroups/Platform" -> null
        # (4 unchanged attributes hidden)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.contributors["Platform-Prod"] will be destroyed
  # (because key ["Platform-Prod"] is not in for_each map)
  - resource "azurerm_role_assignment" "contributors" {
      - id                                     = "/providers/Microsoft.Management/managementGroups/Platform-Prod/providers/Microsoft.Authorization/roleAssignments/6b1d9cf1-3297-e2f2-92fa-0b0a9d6125c0" -> null
      - name                                   = "6b1d9cf1-3297-e2f2-92fa-0b0a9d6125c0" -> null
      - principal_id                           = "d23bf430-3822-4246-bc78-61d54136e547" -> null
      - principal_type                         = "Group" -> null
      - role_definition_id                     = "/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c" -> null
      - role_definition_name                   = "Contributor" -> null
      - scope                                  = "/providers/Microsoft.Management/managementGroups/Platform-Prod" -> null
        # (4 unchanged attributes hidden)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.contributors["SDS"] will be destroyed
  # (because key ["SDS"] is not in for_each map)
  - resource "azurerm_role_assignment" "contributors" {
      - id                                     = "/providers/Microsoft.Management/managementGroups/SDS/providers/Microsoft.Authorization/roleAssignments/0a59adfb-5715-75fb-ddc1-35c75962ceb4" -> null
      - name                                   = "0a59adfb-5715-75fb-ddc1-35c75962ceb4" -> null
      - principal_id                           = "f5fd7dbd-b717-4922-aede-31d6006d44bc" -> null
      - principal_type                         = "Group" -> null
      - role_definition_id                     = "/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c" -> null
      - role_definition_name                   = "Contributor" -> null
      - scope                                  = "/providers/Microsoft.Management/managementGroups/SDS" -> null
        # (4 unchanged attributes hidden)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.contributors["SDS-Prod"] will be destroyed
  # (because key ["SDS-Prod"] is not in for_each map)
  - resource "azurerm_role_assignment" "contributors" {
      - id                                     = "/providers/Microsoft.Management/managementGroups/SDS-Prod/providers/Microsoft.Authorization/roleAssignments/6d33b4ca-4d1d-0eb6-4a7a-a63bb86dcae2" -> null
      - name                                   = "6d33b4ca-4d1d-0eb6-4a7a-a63bb86dcae2" -> null
      - principal_id                           = "ce44f66c-8fd5-4762-b89e-b488a84defef" -> null
      - principal_type                         = "Group" -> null
      - role_definition_id                     = "/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c" -> null
      - role_definition_name                   = "Contributor" -> null
      - scope                                  = "/providers/Microsoft.Management/managementGroups/SDS-Prod" -> null
        # (4 unchanged attributes hidden)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.pim_approvers_contributor["CFT"] will be created
  + resource "azurerm_role_assignment" "pim_approvers_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/CFT"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.pim_approvers_contributor["CFT-Prod"] will be created
  + resource "azurerm_role_assignment" "pim_approvers_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/CFT-Prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.pim_approvers_contributor["Crime"] will be created
  + resource "azurerm_role_assignment" "pim_approvers_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Crime"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.pim_approvers_contributor["HMCTS"] will be created
  + resource "azurerm_role_assignment" "pim_approvers_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/HMCTS"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.pim_approvers_contributor["Heritage"] will be created
  + resource "azurerm_role_assignment" "pim_approvers_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Heritage"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.pim_approvers_contributor["Heritage-Prod"] will be created
  + resource "azurerm_role_assignment" "pim_approvers_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Heritage-Prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.pim_approvers_contributor["Platform"] will be created
  + resource "azurerm_role_assignment" "pim_approvers_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Platform"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.pim_approvers_contributor["Platform-Prod"] will be created
  + resource "azurerm_role_assignment" "pim_approvers_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Platform-Prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.pim_approvers_contributor["SDS"] will be created
  + resource "azurerm_role_assignment" "pim_approvers_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/SDS"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.pim_approvers_contributor["SDS-Prod"] will be created
  + resource "azurerm_role_assignment" "pim_approvers_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/SDS-Prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.production_contributor["CFT"] will be created
  + resource "azurerm_role_assignment" "production_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "b90c1bc9-de15-4ba8-8bff-3b42fa59df1e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/CFT"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.production_contributor["CFT-Prod"] will be created
  + resource "azurerm_role_assignment" "production_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "7ade8023-21c6-4ee1-a8c6-6a9520236809"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/CFT-Prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.production_contributor["Crime"] will be created
  + resource "azurerm_role_assignment" "production_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "009b8482-342f-4de9-8c7c-9681edf566c5"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Crime"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.production_contributor["HMCTS"] will be created
  + resource "azurerm_role_assignment" "production_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "f0e1124b-4e98-4a93-8981-40a659198d21"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/HMCTS"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.production_contributor["Heritage"] will be created
  + resource "azurerm_role_assignment" "production_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "3df758b7-2f50-4617-88cf-681c323d2aff"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Heritage"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.production_contributor["Heritage-Prod"] will be created
  + resource "azurerm_role_assignment" "production_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "7e6f2709-889c-4770-b283-87d04995819d"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Heritage-Prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.production_contributor["Platform"] will be created
  + resource "azurerm_role_assignment" "production_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "a8bbadf2-69a0-4297-be4f-252e400979f8"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Platform"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.production_contributor["Platform-Prod"] will be created
  + resource "azurerm_role_assignment" "production_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "d23bf430-3822-4246-bc78-61d54136e547"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Platform-Prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.production_contributor["SDS"] will be created
  + resource "azurerm_role_assignment" "production_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "f5fd7dbd-b717-4922-aede-31d6006d44bc"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/SDS"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.production_contributor["SDS-Prod"] will be created
  + resource "azurerm_role_assignment" "production_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "ce44f66c-8fd5-4762-b89e-b488a84defef"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/SDS-Prod"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 20 to add, 2 to change, 10 to destroy.
```

</details>





## :warning: Errors

* add a label 635: sandbox_enterprise - TerraformPlanApply/destroy: POST https://api.github.com/repos/hmcts/azure-enterprise/issues/134/labels: 422 Validation Failed [{Resource:Label Field:name Code:invalid Message:}]
<!-- github-comment: {"Command":"plan","PRNumber":134,"Program":"tfcmt","SHA1":"","Target":"635: sandbox_enterprise - TerraformPlanApply","Vars":{}} -->